{
  "knowledge_base": {
    "1. What is Anime?": "Anime is a style of animation that originated in Japan. Unlike Western cartoons, anime often includes complex characters, mature themes, and visually rich storytelling. Anime spans many genres and targets various age groups—from children to adults. Some anime are adapted from manga (Japanese comics), light novels, or video games.",
    
    "2. Good Starter Anime (Based on Preferences)": {
      "Action / Adventure": [
        "Naruto",
        "My Hero Academia",
        "Attack on Titan",
        "Fullmetal Alchemist: Brotherhood"
      ],
      "Slice of Life / Comedy": [
        "Spy x Family",
        "K-On!",
        "Nichijou (My Ordinary Life)",
        "Barakamon"
      ],
      "Romance / Drama": [
        "Your Lie in April",
        "Toradora!",
        "Clannad",
        "Horimiya"
      ],
      "Fantasy / Isekai": [
        "That Time I Got Reincarnated as a Slime",
        "Re:Zero",
        "Sword Art Online",
        "No Game No Life"
      ],
      "Mystery / Psychological": [
        "Death Note",
        "Steins;Gate",
        "Erased",
        "Paranoia Agent"
      ],
      "Anime for Younger Viewers": [
        "Pokémon",
        "Digimon",
        "Doraemon",
        "Beyblade"
      ],
      "Light-Hearted or Feel-Good": [
        "My Neighbour Totoro",
        "Fruits Basket",
        "Natsume’s Book of Friends",
        "The Disastrous Life of Saiki K."
      ]
    },

    "3. Common Anime Genres Explained": {
      "Shounen": "Targeted at young teen boys. Usually features action, friendship, and growth. Example: Naruto, One Piece.",
      "Shoujo": "Aimed at young teen girls. Focuses on romance and emotional development. Example: Sailor Moon, Cardcaptor Sakura.",
      "Seinen": "For adult men. Often deeper themes, violence, or mature content. Example: Berserk, Tokyo Ghoul.",
      "Josei": "For adult women. More realistic romance and daily life. Example: Nana, Honey and Clover.",
      "Isekai": "Characters are transported to another world. Example: Re:Zero, Konosuba.",
      "Mecha": "Focuses on robots and machines. Example: Gundam, Evangelion.",
      "Slice of Life": "Based on everyday life with emotional or comedic elements. Example: March Comes in Like a Lion.",
      "Sports": "Competitive and character-driven sports anime. Example: Haikyuu!!, Kuroko’s Basketball."
    },

    "4. Where to Watch Anime Legally": [
      "Crunchyroll – Large library, free with ads or premium subscription.",
      "Funimation – Dubbed and subbed anime, merging with Crunchyroll.",
      "Netflix – Offers a mix of original and licensed anime.",
      "HiDive – Niche titles and older anime.",
      "Amazon Prime Video – Some exclusives like Vinland Saga.",
      "YouTube – Official channels sometimes stream older episodes."
    ],

    "5. General Anime Questions": {
      "Do I need to watch anime in Japanese?": "No. You can choose between subbed (Japanese with English subtitles) or dubbed (English voiceovers). It’s all about personal preference.",
      "How long is an average anime?": "Most series have 12 or 24 episodes per season. Some long-running shows (like One Piece) have hundreds of episodes.",
      "Is anime only for kids?": "Not at all. Anime covers all age ranges and themes, from fun and silly to dark and serious.",
      "Can I start watching anime without reading manga?": "Absolutely. Anime stands on its own, though reading the manga can sometimes offer more detail.",
      "What is the difference between anime and cartoons?": "While both are animated, anime tends to focus more on deep plots, emotions, and character development. It’s also culturally tied to Japan."
    }
  }
}
